Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.
Q3. Create a Pandas DataFrame that contains the following data:
Name, Age, Gender
Alice, 25, Female
Bob, 30, Male
Claire, 27, Female

Then, print the DataFrame.
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
DataFrame - for tabular data like excel, series show one column only only rowxcolumn structure

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?
head(),tail(),sample(),type(df),df.dtypes

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [23]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
import pandas as pd
ls1 = [4, 8, 15, 16, 23, 42,4,5,6,7]
ser1 = pd.Series(ls1)

#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.
ls2 = [1,2,3,4,5,6,'a','b','c','d']
ser2 = pd.Series(ls2)
print(ser2)

df2 = pd.DataFrame({'ser1':ls1, 'ser2': ls2})
df2

df3 = pd.DataFrame(ls1,ls2)
df3

0    1
1    2
2    3
3    4
4    5
5    6
6    a
7    b
8    c
9    d
dtype: object

    0
1   4
2   8
3  15
4  16
5  23
6  42
a   4
b   5
c   6
d   7

Q3. Create a Pandas DataFrame that contains the following data:
Name, Age, Gender
Alice, 25, Female
Bob, 30, Male
Claire, 27, Female

In [11]:
dic1 = {'Name':['Alice','Bob','Claire'],
        'Age':[25,30,27],
        'Gender':['Female', 'Male', 'Female']
                }
df = pd.DataFrame(dic1)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female